garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F44Q71.PIC
      <edc:DCRDef edc:access="-nnnnnnn" edc:cname="CONFIG5" edc:desc="Configuration byte 5" edc:factorydefault="0xff" edc:impl="0x7f" edc:name="CONFIG5" edc:nzwidth="8" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x7F" edc:default="0xff" edc:_addr="0x300004">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WDTCPS" edc:desc="WDT Period selection bits" edc:mask="0x1f" edc:name="WDTCPS" edc:nzwidth="5">
              <edc:DCRFieldSemantic edc:cname="WDTCPS_0" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_1" edc:desc="Divider ratio 1:64" edc:when="(field &amp; 0x1f) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_2" edc:desc="Divider ratio 1:128" edc:when="(field &amp; 0x1f) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_3" edc:desc="Divider ratio 1:256" edc:when="(field &amp; 0x1f) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_4" edc:desc="Divider ratio 1:512" edc:when="(field &amp; 0x1f) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_5" edc:desc="Divider ratio 1:1024" edc:when="(field &amp; 0x1f) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_6" edc:desc="Divider ratio 1:2048" edc:when="(field &amp; 0x1f) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_7" edc:desc="Divider ratio 1:4096" edc:when="(field &amp; 0x1f) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_8" edc:desc="Divider ratio 1:8192" edc:when="(field &amp; 0x1f) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_9" edc:desc="Divider ratio 1:16384" edc:when="(field &amp; 0x1f) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_10" edc:desc="Divider ratio 1:32768" edc:when="(field &amp; 0x1f) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_11" edc:desc="Divider ratio 1:65536" edc:when="(field &amp; 0x1f) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_12" edc:desc="Divider ratio 1:131072" edc:when="(field &amp; 0x1f) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_13" edc:desc="Divider ratio 1:262144" edc:when="(field &amp; 0x1f) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_14" edc:desc="Divider ratio 1:524299" edc:when="(field &amp; 0x1f) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_15" edc:desc="Divider ratio 1:1048576" edc:when="(field &amp; 0x1f) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_16" edc:desc="Divider ratio 1:2097152" edc:when="(field &amp; 0x1f) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_17" edc:desc="Divider ratio 1:4194304" edc:when="(field &amp; 0x1f) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_18" edc:desc="Divider ratio 1:8388608" edc:when="(field &amp; 0x1f) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_19" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_20" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x14"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_21" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x15"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_22" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x16"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_23" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x17"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_24" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x18"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_25" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x19"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_26" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x1a"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_27" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x1b"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_28" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x1c"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_29" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x1d"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_30" edc:desc="Divider ratio 1:32" edc:when="(field &amp; 0x1f) == 0x1e"/>
              <edc:DCRFieldSemantic edc:cname="WDTCPS_31" edc:desc="Divider ratio 1:65536; software control of WDTPS" edc:when="(field &amp; 0x1f) == 0x1f"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTE" edc:desc="WDT operating mode" edc:mask="0x3" edc:name="WDTE" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="WDT Disabled; SWDTEN is ignored" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="SWDTEN" edc:desc="WDT enabled/disabled by SWDTEN bit" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="NSLEEP" edc:desc="WDT enabled while sleep=0, suspended when sleep=1; SWDTEN ignored" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="WDT enabled regardless of sleep; SWDTEN is ignored" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--nnnnnn" edc:cname="CONFIG6" edc:desc="Configuration byte 6" edc:factorydefault="0xFF" edc:impl="0x3f" edc:name="CONFIG6" edc:nzwidth="0x8" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x3F" edc:default="0xFF" edc:_addr="0x300005">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WDTCWS" edc:desc="WDT Window Select bits" edc:mask="0x7" edc:name="WDTCWS" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="WDTCWS_0" edc:desc="window delay = 87.5; no software control; keyed access required" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="WDTCWS_1" edc:desc="window delay = 75 percent of time; no software control; keyed access required" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WDTCWS_2" edc:desc="window delay = 62.5 percent of time; no software control; keyed access required" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="WDTCWS_3" edc:desc="window delay = 50 percent of time; no software control; keyed access required" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="WDTCWS_4" edc:desc="window delay = 37.5 percent of time; no software control; keyed access required" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="WDTCWS_5" edc:desc="window delay = 25 percent of time; no software control; keyed access required" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="WDTCWS_6" edc:desc="window always open (100%); no software control; keyed access required" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="WDTCWS_7" edc:desc="window always open (100%); software control; keyed access not required" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTCCS" edc:desc="WDT input clock selector" edc:mask="0x7" edc:name="WDTCCS" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="LFINTOSC" edc:desc="WDT reference clock is the 31.0 kHz LFINTOSC" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="MFINTOSC" edc:desc="WDT reference clock is the 32kHz MFINTOSC output" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="SOSC" edc:desc="WDT reference clock is SOSC" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="SC" edc:desc="Software Control" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nnnnnnnn" edc:cname="CONFIG7" edc:desc="Configuration byte 7" edc:factorydefault="0xFF" edc:impl="0xff" edc:name="CONFIG7" edc:nzwidth="0x8" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xFF" edc:default="0xFF" edc:_addr="0x300006">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="BBSIZE" edc:desc="Boot Block Size Selection bits" edc:mask="0xff" edc:name="BBSIZE" edc:nzwidth="0x8">
              <edc:DCRFieldSemantic edc:cname="BBSIZE_4096" edc:desc="Boot Block size is 4096 words" edc:when="(field &amp; 0xff) == 0x1f"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_3968" edc:desc="Boot Block size is 3968 words" edc:when="(field &amp; 0xff) == 0x1e"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_3840" edc:desc="Boot Block size is 3840 words" edc:when="(field &amp; 0xff) == 0x1d"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_3712" edc:desc="Boot Block size is 3712 words" edc:when="(field &amp; 0xff) == 0x1c"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_3584" edc:desc="Boot Block size is 3584 words" edc:when="(field &amp; 0xff) == 0x1b"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_3456" edc:desc="Boot Block size is 3456 words" edc:when="(field &amp; 0xff) == 0x1a"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_3328" edc:desc="Boot Block size is 3328 words" edc:when="(field &amp; 0xff) == 0x19"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_3200" edc:desc="Boot Block size is 3200 words" edc:when="(field &amp; 0xff) == 0x18"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_3072" edc:desc="Boot Block size is 3072 words" edc:when="(field &amp; 0xff) == 0x17"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_2944" edc:desc="Boot Block size is 2944 words" edc:when="(field &amp; 0xff) == 0x16"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_2816" edc:desc="Boot Block size is 2816 words" edc:when="(field &amp; 0xff) == 0x15"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_2688" edc:desc="Boot Block size is 2688 words" edc:when="(field &amp; 0xff) == 0x14"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_2560" edc:desc="Boot Block size is 2560 words" edc:when="(field &amp; 0xff) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_2432" edc:desc="Boot Block size is 2432 words" edc:when="(field &amp; 0xff) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_2304" edc:desc="Boot Block size is 2304 words" edc:when="(field &amp; 0xff) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_2176" edc:desc="Boot Block size is 2176 words" edc:when="(field &amp; 0xff) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_2048" edc:desc="Boot Block size is 2048 words" edc:when="(field &amp; 0xff) == 0x0f"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_1920" edc:desc="Boot Block size is 1920 words" edc:when="(field &amp; 0xff) == 0x0e"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_1792" edc:desc="Boot Block size is 1792 words" edc:when="(field &amp; 0xff) == 0x0d"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_1664" edc:desc="Boot Block size is 1664 words" edc:when="(field &amp; 0xff) == 0x0c"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_1536" edc:desc="Boot Block size is 1536 words" edc:when="(field &amp; 0xff) == 0x0b"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_1408" edc:desc="Boot Block size is 1408 words" edc:when="(field &amp; 0xff) == 0x0a"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_1280" edc:desc="Boot Block size is 1280 words" edc:when="(field &amp; 0xff) == 0x09"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_1152" edc:desc="Boot Block size is 1152 words" edc:when="(field &amp; 0xff) == 0x08"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_1024" edc:desc="Boot Block size is 1024 words" edc:when="(field &amp; 0xff) == 0x07"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_896" edc:desc="Boot Block size is 896 words" edc:when="(field &amp; 0xff) == 0x06"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_768" edc:desc="Boot Block size is 768 words" edc:when="(field &amp; 0xff) == 0x05"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_640" edc:desc="Boot Block size is 640 words" edc:when="(field &amp; 0xff) == 0x04"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_512" edc:desc="Boot Block size is 512 words" edc:when="(field &amp; 0xff) == 0x03"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_384" edc:desc="Boot Block size is 384 words" edc:when="(field &amp; 0xff) == 0x02"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_256" edc:desc="Boot Block size is 256 words" edc:when="(field &amp; 0xff) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_128" edc:desc="Boot Block size is 128 words" edc:when="(field &amp; 0xff) == 0x00"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nnnnnnnn" edc:cname="CONFIG8" edc:desc="Configuration byte 8" edc:factorydefault="0xFF" edc:impl="0xff" edc:name="CONFIG8" edc:nzwidth="0x8" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xFF" edc:default="0xFF" edc:_addr="0x300007">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="SAFSZ" edc:desc="SAF Block Size Selection bits" edc:mask="0xff" edc:name="SAFSZ" edc:nzwidth="0x8">
              <edc:DCRFieldSemantic edc:cname="SAFSZ_NONE" edc:desc="NONE" edc:when="(field &amp; 0xff) == 0xff"/>
              <edc:DCRFieldSemantic edc:cname="SAFSZ_128" edc:desc="Last 128 words of PFM; self write operation depends on WRTSAF bit in CONFIG9" edc:when="(field &amp; 0xff) == 0xfe"/>
              <edc:DCRFieldSemantic edc:cname="SAFSZ_256" edc:desc="Last 256 words of PFM; self write operation depends on WRTSAF bit in CONFIG9" edc:when="(field &amp; 0xff) == 0xfC"/>
              <edc:DCRFieldSemantic edc:cname="SAFSZ_384" edc:desc="Last 384 words of PFM; self write operation depends on WRTSAF bit in CONFIG9" edc:when="(field &amp; 0xff) == 0xf8"/>
              <edc:DCRFieldSemantic edc:cname="SAFSZ_512" edc:desc="Last 512 words of PFM; self write operation depends on WRTSAF bit in CONFIG9" edc:when="(field &amp; 0xff) == 0xf0"/>
              <edc:DCRFieldSemantic edc:cname="SAFSZ_640" edc:desc="Last 640 words of PFM; self write operation depends on WRTSAF bit in CONFIG9" edc:when="(field &amp; 0xff) == 0xe0"/>
              <edc:DCRFieldSemantic edc:cname="SAFSZ_768" edc:desc="Last 768 words of PFM; self write operation depends on WRTSAF bit in CONFIG9" edc:when="(field &amp; 0xff) == 0xC0"/>
              <edc:DCRFieldSemantic edc:cname="SAFSZ_896" edc:desc="Last 896 words of PFM; self write operation depends on WRTSAF bit in CONFIG9" edc:when="(field &amp; 0xff) == 0x80"/>
              <edc:DCRFieldSemantic edc:cname="SAFSZ_1024" edc:desc="Last 1024 words of PFM; self write operation depends on WRTSAF bit in CONFIG9" edc:when="(field &amp; 0xff) == 0x00"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="n---nnnn" edc:cname="CONFIG9" edc:desc="Configuration byte 9" edc:factorydefault="0xFF" edc:impl="0x8F" edc:name="CONFIG9" edc:nzwidth="0x8" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x8F" edc:default="0xFF" edc:_addr="0x300008">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WRTB" edc:desc="Boot Block Write Protection bit" edc:mask="0x1" edc:name="WRTB" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Boot Block not Write protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Boot Block Write protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WRTC" edc:desc="Configuration Register Write Protection bit" edc:mask="0x1" edc:name="WRTC" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Configuration registers not Write protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Configuration registers Write protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WRTD" edc:desc="Data EEPROM Write Protection bit" edc:mask="0x1" edc:name="WRTD" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Data EEPROM not Write protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Data EEPROM Write protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WRTSAF" edc:desc="SAF Write protection bit" edc:mask="0x1" edc:name="WRTSAF" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="SAF not Write Protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="SAF Write Protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:DCRFieldDef edc:cname="WRTAPP" edc:desc="Application Block write protection bit" edc:mask="0x1" edc:name="WRTAPP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Application Block not write protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Application Block write protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="-------n" edc:cname="CONFIG10" edc:desc="Configuration byte 10" edc:factorydefault="0xff" edc:impl="0x01" edc:name="CONFIG10" edc:nzwidth="8" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x01" edc:default="0xff" edc:_addr="0x300009">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="CPD" edc:desc="Data EEPROM Code Protection bit" edc:mask="0x1" edc:name="CPD" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Data EEPROM code protection disabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Data EEPROM code protection enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x0000" edc:checksumalgo="0x27" edc:endaddr="0x20000"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="-------n" edc:cname="CONFIG11" edc:desc="Configuration byte 11" edc:factorydefault="0xff" edc:impl="0x01" edc:name="CONFIG11" edc:nzwidth="8" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x01" edc:default="0xff" edc:_addr="0x30000A">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="CP" edc:desc="PFM Code Protection bit" edc:mask="0x1" edc:name="CP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="PFM code protection disabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="PFM code protection enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x0000" edc:checksumalgo="0x27" edc:endaddr="0x20000"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
