garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F44Q71.PIC
        <edc:SFRDef edc:access="nnnnnnn-" edc:cname="PMD4" edc:desc="" edc:impl="0x8e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000-" edc:name="PMD4" edc:nzwidth="8" edc:por="0000000-" edc:_modsrc="DOS-03793_pmd_mid8_v2_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x66">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CLC1MD" edc:desc="" edc:mask="0x1" edc:name="CLC1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLC2MD" edc:desc="" edc:mask="0x1" edc:name="CLC2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLC3MD" edc:mask="0x1" edc:name="CLC3MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC4MD" edc:desc="" edc:mask="0x1" edc:name="CLC4MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DMA1MD" edc:desc="" edc:mask="0x1" edc:name="DMA1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DMA2MD" edc:desc="" edc:mask="0x1" edc:name="DMA2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DMA3MD" edc:mask="0x1" edc:name="DMA3MD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMD5" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="PMD5" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-03793_pmd_mid8_v2_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x67">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DMA4MD" edc:desc="" edc:mask="0x1" edc:name="DMA4MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC2MD" edc:desc="" edc:mask="0x1" edc:name="DAC2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPA1MD" edc:desc="" edc:mask="0x1" edc:name="OPA1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPA2MD" edc:desc="" edc:mask="0x1" edc:name="OPA2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLC5MD" edc:mask="0x1" edc:name="CLC5MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC6MD" edc:mask="0x1" edc:name="CLC6MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC7MD" edc:mask="0x1" edc:name="CLC7MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC8MD" edc:mask="0x1" edc:name="CLC8MD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n---nnnn" edc:cname="PMD6" edc:desc="" edc:impl="0x8f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0---0000" edc:name="PMD6" edc:nzwidth="8" edc:por="0---0000" edc:_modsrc="DOS-03793_pmd_mid8_v2_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x68">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TU16AMD" edc:desc="" edc:mask="0x1" edc:name="TU16AMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TU16BMD" edc:desc="" edc:mask="0x1" edc:name="TU16BMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC3MD" edc:desc="" edc:mask="0x1" edc:name="DAC3MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PORTWMD" edc:mask="0x1" edc:name="PORTWMD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="CCP2MD" edc:mask="0x1" edc:name="CCP2MD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TU1MD" edc:desc="" edc:mask="0x1" edc:name="TU1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TU2MD" edc:desc="" edc:mask="0x1" edc:name="TU2MD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x6" edc:_addr="0x69"/>
        <edc:SFRDef edc:access="------rr" edc:cname="CMOUT" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="CMOUT" edc:nzwidth="8" edc:por="------00" edc:_addr="0x6F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MC1OUT" edc:mask="0x1" edc:name="MC1OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MC2OUT" edc:mask="0x1" edc:name="MC2OUT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nrnn-nnn" edc:cname="CM1CON0" edc:desc="COMPARATOR CONTROL REGISTER 0" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-uu0" edc:name="CM1CON0" edc:nzwidth="8" edc:por="0000-xx0" edc:_modsrc="DOS-05121_cmp_rr_ctrl_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x70">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SYNC" edc:desc="Comparator Output Synchronous Mode bit" edc:mask="0x1" edc:name="SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HYS" edc:desc="Comparator Hysteresis Enable bit" edc:mask="0x3" edc:name="HYS" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="Comparator Output Polarity Select bit" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OE" edc:desc="Comparator Output Enable bit" edc:mask="0x1" edc:name="OE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="Comparator Output bit" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="Comparator Enable bit" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="HYS0" edc:desc="Comparator Hysteresis Enable bit" edc:mask="0x1" edc:name="HYS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HYS1" edc:desc="Comparator Hysteresis Enable bit" edc:mask="0x1" edc:name="HYS1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C1SYNC" edc:desc="Comparator Output Synchronous Mode bit" edc:mask="0x1" edc:name="C1SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1HYS" edc:desc="Comparator Hysteresis Enable bit" edc:mask="0x1" edc:name="C1HYS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1HYS1" edc:desc="Comparator Hysteresis Enable bit" edc:mask="0x1" edc:name="C1HYS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C1POL" edc:desc="Comparator Output Polarity Select bit" edc:mask="0x1" edc:name="C1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1OE" edc:desc="Comparator Output Enable bit" edc:mask="0x1" edc:name="C1OE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1OUT" edc:desc="Comparator Output bit" edc:mask="0x1" edc:name="C1OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1EN" edc:desc="Comparator Enable bit" edc:mask="0x1" edc:name="C1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n---nnnn" edc:cname="CM1CON1" edc:desc="COMPARATOR CONTROL REGISTER 1" edc:impl="0x8f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u---uu00" edc:name="CM1CON1" edc:nzwidth="8" edc:por="x---xx00" edc:_modsrc="DOS-05121_cmp_rr_ctrl_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x71">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INTN" edc:desc="Comparator Interrupt on Negative going edge Enable bits" edc:mask="0x1" edc:name="INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTP" edc:desc="Comparator Interrupt on Positive going edge Enable bits" edc:mask="0x1" edc:name="INTP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SP" edc:mask="0x3" edc:name="SP" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="RDY" edc:mask="0x1" edc:name="RDY" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="SP0" edc:mask="0x1" edc:name="SP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SP1" edc:mask="0x1" edc:name="SP1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C1INTN" edc:desc="Comparator Interrupt on Negative going edge Enable bits" edc:mask="0x1" edc:name="C1INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1INTP" edc:desc="Comparator Interrupt on Positive going edge Enable bits" edc:mask="0x1" edc:name="C1INTP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1SP0" edc:desc="Comparator Speed/Power Select bit" edc:mask="0x1" edc:name="C1SP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C1SP1" edc:mask="0x1" edc:name="C1SP1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C1RDY" edc:mask="0x1" edc:name="C1RDY" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="CM1NCH" edc:desc="COMPARATOR INVERTING CHANNEL SELECT REGISTER" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="CM1NCH" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-05121_cmp_rr_ctrl_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x72">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NCH" edc:desc="Comparator Inverting Input Channel Select bits" edc:mask="0x7" edc:name="NCH" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="NCH0" edc:desc="Comparator Inverting Input Channel Select bits" edc:mask="0x1" edc:name="NCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NCH1" edc:desc="Comparator Inverting Input Channel Select bits" edc:mask="0x1" edc:name="NCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NCH2" edc:desc="Comparator Inverting Input Channel Select bits" edc:mask="0x1" edc:name="NCH2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C1NCH0" edc:desc="Comparator Inverting Input Channel Select bits" edc:mask="0x1" edc:name="C1NCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1NCH1" edc:desc="Comparator Inverting Input Channel Select bits" edc:mask="0x1" edc:name="C1NCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1NCH2" edc:desc="Comparator Inverting Input Channel Select bits" edc:mask="0x1" edc:name="C1NCH2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="CM1PCH" edc:desc="COMPARATOR NON-INVERTING CHANNEL SELECT REGISTER" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="CM1PCH" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-05121_cmp_rr_ctrl_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x73">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCH" edc:desc="Comparator Non-Inverting Input Channel Select bits" edc:mask="0x7" edc:name="PCH" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="PCH0" edc:desc="Comparator Non-Inverting Input Channel Select bits" edc:mask="0x1" edc:name="PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH1" edc:desc="Comparator Non-Inverting Input Channel Select bits" edc:mask="0x1" edc:name="PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH2" edc:desc="Comparator Non-Inverting Input Channel Select bits" edc:mask="0x1" edc:name="PCH2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C1PCH0" edc:desc="Comparator Non-Inverting Input Channel Select bits" edc:mask="0x1" edc:name="C1PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1PCH1" edc:desc="Comparator Non-Inverting Input Channel Select bits" edc:mask="0x1" edc:name="C1PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1PCH2" edc:desc="Comparator Non-Inverting Input Channel Select bits" edc:mask="0x1" edc:name="C1PCH2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nrnn-nnn" edc:cname="CM2CON0" edc:desc="COMPARATOR CONTROL REGISTER 0" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-uu0" edc:name="CM2CON0" edc:nzwidth="8" edc:por="0000-xx0" edc:_modsrc="DOS-05121_cmp_rr_ctrl_v3.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x74">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SYNC" edc:desc="Comparator Output Synchronous Mode bit" edc:mask="0x1" edc:name="SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HYS" edc:desc="Comparator Hysteresis Enable bit" edc:mask="0x3" edc:name="HYS" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="Comparator Output Polarity Select bit" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OE" edc:desc="Comparator Output Enable bit" edc:mask="0x1" edc:name="OE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="Comparator Output bit" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="Comparator Enable bit" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="HYS0" edc:desc="Comparator Hysteresis Enable bit" edc:mask="0x1" edc:name="HYS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HYS1" edc:desc="Comparator Hysteresis Enable bit" edc:mask="0x1" edc:name="HYS1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C2SYNC" edc:desc="Comparator Output Synchronous Mode bit" edc:mask="0x1" edc:name="C2SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2HYS" edc:desc="Comparator Hysteresis Enable bit" edc:mask="0x1" edc:name="C2HYS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2HYS1" edc:desc="Comparator Hysteresis Enable bit" edc:mask="0x1" edc:name="C2HYS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C2POL" edc:desc="Comparator Output Polarity Select bit" edc:mask="0x1" edc:name="C2POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2OE" edc:desc="Comparator Output Enable bit" edc:mask="0x1" edc:name="C2OE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2OUT" edc:desc="Comparator Output bit" edc:mask="0x1" edc:name="C2OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2EN" edc:desc="Comparator Enable bit" edc:mask="0x1" edc:name="C2EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
