garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F44Q71.PIC
        <edc:SFRDef edc:access="----nnnn" edc:cname="PORTWIN4" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PORTWIN4" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-05249_io_vport_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x106">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IN" edc:mask="0xf" edc:name="IN" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IN0" edc:mask="0x1" edc:name="IN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN1" edc:mask="0x1" edc:name="IN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN2" edc:mask="0x1" edc:name="IN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN3" edc:mask="0x1" edc:name="IN3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PORTWIN5" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PORTWIN5" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-05249_io_vport_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x107">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IN" edc:mask="0xf" edc:name="IN" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IN0" edc:mask="0x1" edc:name="IN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN1" edc:mask="0x1" edc:name="IN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN2" edc:mask="0x1" edc:name="IN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN3" edc:mask="0x1" edc:name="IN3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PORTWIN6" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PORTWIN6" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-05249_io_vport_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x108">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IN" edc:mask="0xf" edc:name="IN" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IN0" edc:mask="0x1" edc:name="IN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN1" edc:mask="0x1" edc:name="IN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN2" edc:mask="0x1" edc:name="IN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN3" edc:mask="0x1" edc:name="IN3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PORTWIN7" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PORTWIN7" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-05249_io_vport_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x109">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IN" edc:mask="0xf" edc:name="IN" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IN0" edc:mask="0x1" edc:name="IN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN1" edc:mask="0x1" edc:name="IN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN2" edc:mask="0x1" edc:name="IN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN3" edc:mask="0x1" edc:name="IN3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="PORTWCLK" edc:desc="Virtual Port Control Register" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="PORTWCLK" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-05249_io_vport_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x10A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLK" edc:mask="0x1f" edc:name="CLK" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLK0" edc:mask="0x1" edc:name="CLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK1" edc:mask="0x1" edc:name="CLK1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK2" edc:mask="0x1" edc:name="CLK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK3" edc:mask="0x1" edc:name="CLK3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK4" edc:mask="0x1" edc:name="CLK4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWCLK" edc:mask="0x1f" edc:name="PWCLK" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
