garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F44Q71.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="U1CTSPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="U1CTSPPS" edc:nzwidth="8" edc:por="--010110" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3d" edc:_addr="0x273">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U1CTSPPS0" edc:mask="0x1" edc:name="U1CTSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1CTSPPS1" edc:mask="0x1" edc:name="U1CTSPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1CTSPPS2" edc:mask="0x1" edc:name="U1CTSPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1CTSPPS3" edc:mask="0x1" edc:name="U1CTSPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1CTSPPS4" edc:mask="0x1" edc:name="U1CTSPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1CTSPPS5" edc:mask="0x1" edc:name="U1CTSPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U1CTSPPS" edc:mask="0x3f" edc:name="U1CTSPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="U2RXPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="U2RXPPS" edc:nzwidth="8" edc:por="--001111" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3d" edc:_addr="0x274">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U2RXPPS0" edc:mask="0x1" edc:name="U2RXPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2RXPPS1" edc:mask="0x1" edc:name="U2RXPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2RXPPS2" edc:mask="0x1" edc:name="U2RXPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2RXPPS3" edc:mask="0x1" edc:name="U2RXPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2RXPPS4" edc:mask="0x1" edc:name="U2RXPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2RXPPS5" edc:mask="0x1" edc:name="U2RXPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U2RXPPS" edc:mask="0x3f" edc:name="U2RXPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="U2CTSPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="U2CTSPPS" edc:nzwidth="8" edc:por="--001110" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3d" edc:_addr="0x275">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U2CTSPPS0" edc:mask="0x1" edc:name="U2CTSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2CTSPPS1" edc:mask="0x1" edc:name="U2CTSPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2CTSPPS2" edc:mask="0x1" edc:name="U2CTSPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2CTSPPS3" edc:mask="0x1" edc:name="U2CTSPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2CTSPPS4" edc:mask="0x1" edc:name="U2CTSPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2CTSPPS5" edc:mask="0x1" edc:name="U2CTSPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U2CTSPPS" edc:mask="0x3f" edc:name="U2CTSPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="OPA1ORPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="OPA1ORPPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3d" edc:_addr="0x276">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="OPA1PPS0" edc:mask="0x1" edc:name="OPA1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1PPS1" edc:mask="0x1" edc:name="OPA1PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1PPS2" edc:mask="0x1" edc:name="OPA1PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1PPS3" edc:mask="0x1" edc:name="OPA1PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1PPS4" edc:mask="0x1" edc:name="OPA1PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1PPS5" edc:mask="0x1" edc:name="OPA1PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA1PPS" edc:mask="0x3f" edc:name="OPA1PPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="OPA2ORPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="OPA2ORPPS" edc:nzwidth="8" edc:por="--010110" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3d" edc:_addr="0x277">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="OPA2PPS0" edc:mask="0x1" edc:name="OPA2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2PPS1" edc:mask="0x1" edc:name="OPA2PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2PPS2" edc:mask="0x1" edc:name="OPA2PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2PPS3" edc:mask="0x1" edc:name="OPA2PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2PPS4" edc:mask="0x1" edc:name="OPA2PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2PPS5" edc:mask="0x1" edc:name="OPA2PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA2PPS" edc:mask="0x3f" edc:name="OPA2PPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TUIN0PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="TUIN0PPS" edc:nzwidth="8" edc:por="--010000" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3d" edc:_addr="0x278">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TUIN0PPS0" edc:mask="0x1" edc:name="TUIN0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUIN0PPS1" edc:mask="0x1" edc:name="TUIN0PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUIN0PPS2" edc:mask="0x1" edc:name="TUIN0PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUIN0PPS3" edc:mask="0x1" edc:name="TUIN0PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUIN0PPS4" edc:mask="0x1" edc:name="TUIN0PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUIN0PPS5" edc:mask="0x1" edc:name="TUIN0PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TUIN0PPS" edc:mask="0x3f" edc:name="TUIN0PPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
