garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F44Q71.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16AHLT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="01000000" edc:name="TU16AHLT" edc:nzwidth="8" edc:por="01000000" edc:_modsrc="DOS-03877_tmr_8bit_v1_16bits.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x3A2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STOP" edc:mask="0x3" edc:name="STOP" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="RESET" edc:mask="0x3" edc:name="RESET" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="START" edc:mask="0x3" edc:name="START" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="CSYNC" edc:mask="0x1" edc:name="CSYNC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPOL" edc:mask="0x1" edc:name="EPOL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="STOP0" edc:mask="0x1" edc:name="STOP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STOP1" edc:mask="0x1" edc:name="STOP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RESET0" edc:mask="0x1" edc:name="RESET0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RESET1" edc:mask="0x1" edc:name="RESET1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="START0" edc:mask="0x1" edc:name="START0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="START1" edc:mask="0x1" edc:name="START1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TU16ASTOP" edc:mask="0x3" edc:name="TU16ASTOP" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TU16ARESET" edc:mask="0x3" edc:name="TU16ARESET" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TU16ASTART" edc:mask="0x3" edc:name="TU16ASTART" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TU16ACSYNC" edc:mask="0x1" edc:name="TU16ACSYNC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16AEPOL" edc:mask="0x1" edc:name="TU16AEPOL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="TU16ASTOP0" edc:mask="0x1" edc:name="TU16ASTOP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16ASTOP1" edc:mask="0x1" edc:name="TU16ASTOP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16ARESET0" edc:mask="0x1" edc:name="TU16ARESET0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16ARESET1" edc:mask="0x1" edc:name="TU16ARESET1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16ASTART0" edc:mask="0x1" edc:name="TU16ASTART0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16ASTART1" edc:mask="0x1" edc:name="TU16ASTART1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16APS" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16APS" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03877_tmr_8bit_v1_16bits.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x3A3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PS" edc:mask="0xff" edc:name="PS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PS0" edc:mask="0x1" edc:name="PS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS1" edc:mask="0x1" edc:name="PS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS2" edc:mask="0x1" edc:name="PS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS3" edc:mask="0x1" edc:name="PS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS4" edc:mask="0x1" edc:name="PS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS5" edc:mask="0x1" edc:name="PS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS6" edc:mask="0x1" edc:name="PS6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS7" edc:mask="0x1" edc:name="PS7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TU16APS0" edc:mask="0x1" edc:name="TU16APS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16APS1" edc:mask="0x1" edc:name="TU16APS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16APS2" edc:mask="0x1" edc:name="TU16APS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16APS3" edc:mask="0x1" edc:name="TU16APS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16APS4" edc:mask="0x1" edc:name="TU16APS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16APS5" edc:mask="0x1" edc:name="TU16APS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16APS6" edc:mask="0x1" edc:name="TU16APS6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16APS7" edc:mask="0x1" edc:name="TU16APS7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="TU16APS" edc:mask="0xff" edc:name="TU16APS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="TU16ATMR" edc:desc="" edc:name="TU16ATMR" edc:nzwidth="0x10" edc:_modsrc="DOS-03877_tmr_8bit_v1_16bits.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x3A4">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TU16ACR"/>
          </edc:AliasList>
          <edc:MuxedSFRDef edc:nzwidth="0x8" edc:_addr="0x3A4">
            <edc:SelectSFR edc:when="($0x0 &amp; 0x08) == 0x1">
              <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16ATMRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16ATMRL" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x3A4">
                <edc:AliasList/>
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="TMRL" edc:desc="" edc:mask="0xff" edc:name="TMRL" edc:nzwidth="8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="TMRL0" edc:mask="0x1" edc:name="TMRL0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRL1" edc:mask="0x1" edc:name="TMRL1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRL2" edc:mask="0x1" edc:name="TMRL2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRL3" edc:mask="0x1" edc:name="TMRL3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRL4" edc:mask="0x1" edc:name="TMRL4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRL5" edc:mask="0x1" edc:name="TMRL5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRL6" edc:mask="0x1" edc:name="TMRL6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRL7" edc:mask="0x1" edc:name="TMRL7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.1">
                    <edc:SFRFieldDef edc:cname="TU16ATMRL0" edc:mask="0x1" edc:name="TU16ATMRL0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMRL1" edc:mask="0x1" edc:name="TU16ATMRL1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMRL2" edc:mask="0x1" edc:name="TU16ATMRL2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMRL3" edc:mask="0x1" edc:name="TU16ATMRL3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMRL4" edc:mask="0x1" edc:name="TU16ATMRL4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMRL5" edc:mask="0x1" edc:name="TU16ATMRL5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMRL6" edc:mask="0x1" edc:name="TU16ATMRL6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMRL7" edc:mask="0x1" edc:name="TU16ATMRL7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.2">
                    <edc:SFRFieldDef edc:cname="TU16ATMR0" edc:mask="0x1" edc:name="TU16ATMR0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMR1" edc:mask="0x1" edc:name="TU16ATMR1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMR2" edc:mask="0x1" edc:name="TU16ATMR2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMR3" edc:mask="0x1" edc:name="TU16ATMR3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMR4" edc:mask="0x1" edc:name="TU16ATMR4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMR5" edc:mask="0x1" edc:name="TU16ATMR5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMR6" edc:mask="0x1" edc:name="TU16ATMR6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMR7" edc:mask="0x1" edc:name="TU16ATMR7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
            <edc:SelectSFR edc:when="($0x0 &amp; 0x08) == 0x0">
              <edc:SFRDef edc:access="rrrrrrrr" edc:cname="TU16ACRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16ACRL" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x3A4">
                <edc:AliasList/>
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="CRL" edc:desc="" edc:mask="0xff" edc:name="CRL" edc:nzwidth="8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="CRL0" edc:mask="0x1" edc:name="CRL0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRL1" edc:mask="0x1" edc:name="CRL1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRL2" edc:mask="0x1" edc:name="CRL2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRL3" edc:mask="0x1" edc:name="CRL3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRL4" edc:mask="0x1" edc:name="CRL4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRL5" edc:mask="0x1" edc:name="CRL5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRL6" edc:mask="0x1" edc:name="CRL6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRL7" edc:mask="0x1" edc:name="CRL7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.1">
                    <edc:SFRFieldDef edc:cname="TU16ACRL0" edc:mask="0x1" edc:name="TU16ACRL0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACRL1" edc:mask="0x1" edc:name="TU16ACRL1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACRL2" edc:mask="0x1" edc:name="TU16ACRL2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACRL3" edc:mask="0x1" edc:name="TU16ACRL3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACRL4" edc:mask="0x1" edc:name="TU16ACRL4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACRL5" edc:mask="0x1" edc:name="TU16ACRL5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACRL6" edc:mask="0x1" edc:name="TU16ACRL6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACRL7" edc:mask="0x1" edc:name="TU16ACRL7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.2">
                    <edc:SFRFieldDef edc:cname="TU16ACR0" edc:mask="0x1" edc:name="TU16ACR0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACR1" edc:mask="0x1" edc:name="TU16ACR1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACR2" edc:mask="0x1" edc:name="TU16ACR2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACR3" edc:mask="0x1" edc:name="TU16ACR3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACR4" edc:mask="0x1" edc:name="TU16ACR4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACR5" edc:mask="0x1" edc:name="TU16ACR5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACR6" edc:mask="0x1" edc:name="TU16ACR6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACR7" edc:mask="0x1" edc:name="TU16ACR7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
          </edc:MuxedSFRDef>
          <edc:MuxedSFRDef edc:nzwidth="0x8" edc:_addr="0x3A5">
            <edc:SelectSFR edc:when="($0x0 &amp; 0x08) == 0x1">
              <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16ATMRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16ATMRH" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x3A5">
                <edc:AliasList/>
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="TMRH" edc:desc="" edc:mask="0xff" edc:name="TMRH" edc:nzwidth="8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="TMRH0" edc:mask="0x1" edc:name="TMRH0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRH1" edc:mask="0x1" edc:name="TMRH1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRH2" edc:mask="0x1" edc:name="TMRH2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRH3" edc:mask="0x1" edc:name="TMRH3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRH4" edc:mask="0x1" edc:name="TMRH4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRH5" edc:mask="0x1" edc:name="TMRH5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRH6" edc:mask="0x1" edc:name="TMRH6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRH7" edc:mask="0x1" edc:name="TMRH7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.1">
                    <edc:SFRFieldDef edc:cname="TU16ATMRH0" edc:mask="0x1" edc:name="TU16ATMRH0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMRH1" edc:mask="0x1" edc:name="TU16ATMRH1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMRH2" edc:mask="0x1" edc:name="TU16ATMRH2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMRH3" edc:mask="0x1" edc:name="TU16ATMRH3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMRH4" edc:mask="0x1" edc:name="TU16ATMRH4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMRH5" edc:mask="0x1" edc:name="TU16ATMRH5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMRH6" edc:mask="0x1" edc:name="TU16ATMRH6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMRH7" edc:mask="0x1" edc:name="TU16ATMRH7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.2">
                    <edc:SFRFieldDef edc:cname="TU16ATMR8" edc:mask="0x1" edc:name="TU16ATMR8" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMR9" edc:mask="0x1" edc:name="TU16ATMR9" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMR10" edc:mask="0x1" edc:name="TU16ATMR10" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMR11" edc:mask="0x1" edc:name="TU16ATMR11" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMR12" edc:mask="0x1" edc:name="TU16ATMR12" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMR13" edc:mask="0x1" edc:name="TU16ATMR13" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMR14" edc:mask="0x1" edc:name="TU16ATMR14" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ATMR15" edc:mask="0x1" edc:name="TU16ATMR15" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
            <edc:SelectSFR edc:when="($0x0 &amp; 0x08) == 0x0">
              <edc:SFRDef edc:access="rrrrrrrr" edc:cname="TU16ACRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16ACRH" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x3A5">
                <edc:AliasList/>
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="CRH" edc:desc="" edc:mask="0xff" edc:name="CRH" edc:nzwidth="8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="CRH0" edc:mask="0x1" edc:name="CRH0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRH1" edc:mask="0x1" edc:name="CRH1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRH2" edc:mask="0x1" edc:name="CRH2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRH3" edc:mask="0x1" edc:name="CRH3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRH4" edc:mask="0x1" edc:name="CRH4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRH5" edc:mask="0x1" edc:name="CRH5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRH6" edc:mask="0x1" edc:name="CRH6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRH7" edc:mask="0x1" edc:name="CRH7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.1">
                    <edc:SFRFieldDef edc:cname="TU16ACRH0" edc:mask="0x1" edc:name="TU16ACRH0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACRH1" edc:mask="0x1" edc:name="TU16ACRH1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACRH2" edc:mask="0x1" edc:name="TU16ACRH2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACRH3" edc:mask="0x1" edc:name="TU16ACRH3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACRH4" edc:mask="0x1" edc:name="TU16ACRH4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACRH5" edc:mask="0x1" edc:name="TU16ACRH5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACRH6" edc:mask="0x1" edc:name="TU16ACRH6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACRH7" edc:mask="0x1" edc:name="TU16ACRH7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.2">
                    <edc:SFRFieldDef edc:cname="TU16ACR8" edc:mask="0x1" edc:name="TU16ACR8" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACR9" edc:mask="0x1" edc:name="TU16ACR9" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACR10" edc:mask="0x1" edc:name="TU16ACR10" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACR11" edc:mask="0x1" edc:name="TU16ACR11" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACR12" edc:mask="0x1" edc:name="TU16ACR12" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACR13" edc:mask="0x1" edc:name="TU16ACR13" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACR14" edc:mask="0x1" edc:name="TU16ACR14" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16ACR15" edc:mask="0x1" edc:name="TU16ACR15" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
          </edc:MuxedSFRDef>
        </edc:JoinedSFRDef>
